Revit 2027 API
ViewDisplayModel.Transparency Property
 The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Transparency { get; set; }
Public Property Transparency As Integer
	Get
	Set
public:
property int Transparency {
	int get ();
	void set (int value);
}
member Transparency : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is invalid. The valid range is 0 through 100
See Also
Reference
ViewDisplayModel Class
Autodesk.Revit.DB Namespace